>**기출문제 제8회**
>>**01 작업형 제1유형**

## 옵션 설정

In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None) # 모든 칼럼이 출력되게 조절

## 문제 1. 
- 다음의 데이터는 대륙별 국가의 맥주소비량을 조사한 것이다. 
   + 평균 맥주소비량이 가장 많은 대륙을 구하시오.
   + 이전 문제에서 구한 대륙에서 5번째로 전체 맥주소비량이 많은 나라를 구하시오. 
   + 이전 문제에서 구한 나라의 평균 맥주소비량을 구하시오. (소수점 첫째 자리에서 반올림)

In [9]:
data1 = pd.read_csv('8_1_1.csv') 
data1.head(5)

   대륙           국가  맥주소비량
0  AS  Afghanistan    102
1  AS  Afghanistan    435
2  AS  Afghanistan    348
3  AS  Afghanistan    270
4  AS  Afghanistan    106

In [18]:
# 코드

대륙: SA

In [19]:
# 코드

국가: Venezuela
평균 맥주소비량: 253.0

## 문제 2. 
- 다음의 데이터는 국가별로 방문객 유형을 조사한 것이다. 
- 관광객비율이 두 번째로 높은 나라의 '관광' 수를 구하시오. 
   + 관광객비율=관광/합계(소수점 넷째 자리에서 반올림)
   + 합계=관광+사무+공무+유학+기타
- 관광 수가 두번째로 높은 나라의 '공무'수의 평균을 구하시오. (소수점 첫째 자리에서 반올림)
- 이전에 구한 관광 수와 공무 수의 합계를 구하시오.

In [20]:
data2 = pd.read_csv('8_1_2.csv')
data2.head()

         국가    관광    사무   공무    유학   기타
0  남아프리카공화국  9198  1415  234   178  340
1       스페인  7127   409  422  3489  193
2      싱가포르  9640  1751  508  3536  709
3      이탈리아  3358  1370  880  4620  459
4        일본  3980   160   64   204  303

In [22]:
# 각 국가별 합계 계산
# 코드

         국가    관광    사무   공무    유학   기타     합계
0  남아프리카공화국  9198  1415  234   178  340  11365
1       스페인  7127   409  422  3489  193  11640
2      싱가포르  9640  1751  508  3536  709  16144
3      이탈리아  3358  1370  880  4620  459  10687
4        일본  3980   160   64   204  303   4711

In [24]:
# 문제에 정의된 기준에 맞춰서 관광객비율 컬럼 생성 
# 코드

         국가    관광    사무   공무    유학   기타     합계  관광객비율
0  남아프리카공화국  9198  1415  234   178  340  11365  0.809
1       스페인  7127   409  422  3489  193  11640  0.612
2      싱가포르  9640  1751  508  3536  709  16144  0.597
3      이탈리아  3358  1370  880  4620  459  10687  0.314
4        일본  3980   160   64   204  303   4711  0.845

In [32]:
# 관광객비율이 두 번째로 높은 나라의 관광 수 계산 
# 코드

7831

In [29]:
# 관광 수가 두번째로 높은 나라의 '공무'수의 평균을 구하시오. (소수점 첫째 자리에서 반올림)
# 코드드

이스라엘 494.0

In [33]:
# 관광 수와 공무 수의 합계
# 코드드

관광 + 공무: 8325.0

## 문제 3. 
- CO(GT), NMHC(GT) 컬럼에 대해서 Min-Max 정규화 실행
- 스케일링된 CO(GT), NMHC(GT) 컬럼의 표준편차를 구하시오. 
- 소수점 셋째 자리에서 반올림
- Min-Max 정규화 식 
    + 정규화 식 : 데이터에서 최솟값을 뺀 값을 최댓값과 최솟값의 차이로 나누어 계산
$$X_{norm} = \frac{X - X_{min}}{X_{max} - X_{min}}$$

In [36]:
data3 = pd.read_csv('8_1_3.csv')
data3.head(1)

         Date      Time  CO(GT)  PT08.S1(CO)  NMHC(GT)  C6H6(GT)
0  13/10/2004  06.00.00  -200.0        798.0    -200.0       2.2

In [37]:
# 코드

CO(GT) 정규화 후 표준편차: 0.37
NMHC(GT) 정규화 후 표준편차: 0.15